---
kind: type
id: T:Autodesk.Revit.DB.PlanViewRangeLevel
source: html/f39eba05-f199-9492-a9c8-db4b94a92785.htm
---
# Autodesk.Revit.DB.PlanViewRangeLevel

An enumerated type representing the options for setting the range for a plan view.

## Syntax (C#)
```csharp
public enum PlanViewRangeLevel
```